
 I'm searching for passengers similar to Myself:
 - Male
 - 16-18
 - Would likely travel 3rd class
 - Traveling with family
 - Lower fare

In [10]:
import sqlite3
import pandas as pd

# Connect to database
conn = sqlite3.connect('titanic.db')
print("✅ Connected to database")

✅ Connected to database

In [13]:
query = """
    SELECT Name, Age, Sex, Pclass, Survived, SibSp, Fare
    FROM passengers
    WHERE Sex = 'male' AND Age >=16 AND Age <= 18
        AND Pclass = 3 AND Survived = 1
    ORDER BY Fare ASC
    LIMIT 10;
"""

result = pd.read_sql(query, conn)
display(result)

                             name   age   sex  pclass  survived  sibsp  fare
0        Cohen, Mr. Gurshon "Gus"  18.0  male       3         1      0  8.05
1  Sunderland, Mr. Victor Francis  16.0  male       3         1      0  8.05

I PICK GUS:
Gus is cool, just like me. They have low fares, and are in 3rd class, just like me. They are also men, and I'm a man, so that matches pretty well. There's no other  individuals that are my age that payed a low fare other than Victor, who has the same other statistics but is younger.
The most important factors are (Which left me with two options):
Age: 18.0
Sex: Male
Pclass: 3
Survived: 1

My Report on Mr. Gurshon "Gus" Cohen:

Mr. Gurshon "Gus" Cohen stands out as one of the few third-class passengers who managed to survive the sinking of the Titanic. At 18 years old, he was a young man whose demographic and socio-economic profile closely matched the specific criteria I used in my search. He paid just $8.05 for his journey, representing the common financial experience of those traveling in third class. I chose to focus on Gus because he shared my age, gender, and economic status, making his survival story feel relevant to me. Ultimately, he represents the most accurate match for my own profile among those found in the database. 

Encyclopedia Titanic states that Gus was born in London, England, on December 31, 1892. He was Jewish and was part of a large family that moved to London from the Russian Area. He had a printing business, and due to its failure in London, he planned to cross over to the Americas and unite with his Uncle who had a business in New York.